const GameData = {
  "killers": [
    {
      "name": "농부",
      "file": "용의자/농부.png"
    },
    {
      "name": "교사",
      "file": "용의자/교사.png"
    },
    {
      "name": "외교관",
      "file": "용의자/외교관.png"
    },
    {
      "name": "정치인",
      "file": "용의자/정치인.png"
    },
    {
      "name": "가수",
      "file": "용의자/가수.png"
    },
    {
      "name": "작곡가",
      "file": "용의자/작곡가.png"
    },
    {
      "name": "음악가",
      "file": "용의자/음악가.png"
    },
    {
      "name": "마약상",
      "file": "용의자/마약상.png"
    },
    {
      "name": "사기꾼",
      "file": "용의자/사기꾼.png"
    },
    {
      "name": "깡패",
      "file": "용의자/깡패.png"
    },
    {
      "name": "바텐더",
      "file": "용의자/바텐더.png"
    },
    {
      "name": "시인",
      "file": "용의자/시인.png"
    },
    {
      "name": "복서",
      "file": "용의자/복서.png"
    },
    {
      "name": "배우",
      "file": "용의자/배우.png"
    },
    {
      "name": "변호사",
      "file": "용의자/변호사.png"
    },
    {
      "name": "간호사",
      "file": "용의자/간호사.png"
    },
    {
      "name": "정비사",
      "file": "용의자/정비사.png"
    },
    {
      "name": "소방관",
      "file": "용의자/소방관.png"
    },
    {
      "name": "아이돌",
      "file": "용의자/아이돌.png"
    },
    {
      "name": "미용사",
      "file": "용의자/미용사.png"
    },
    {
      "name": "신문 기자",
      "file": "용의자/신문 기자.png"
    },
    {
      "name": "개그우먼",
      "file": "용의자/개그우먼.png"
    },
    {
      "name": "군인",
      "file": "용의자/군인.png"
    },
    {
      "name": "경호원",
      "file": "용의자/경호원.png"
    },
    {
      "name": "사진작가",
      "file": "용의자/사진작가.png"
    },
    {
      "name": "탐험가",
      "file": "용의자/탐험가.png"
    },
    {
      "name": "유튜버",
      "file": "용의자/유튜버.png"
    },
    {
      "name": "영화감독",
      "file": "용의자/영화감독.png"
    },
    {
      "name": "트레이너",
      "file": "용의자/트레이너.png"
    },
    {
      "name": "의사",
      "file": "용의자/의사.png"
    },
    {
      "name": "수영선수",
      "file": "용의자/수영선수.png"
    },
    {
      "name": "건축가",
      "file": "용의자/건축가.png"
    }
  ],
  "motives": [
    {
      "name": "층간소음",
      "file": "동기/층간소음.png"
    },
    {
      "name": "과음",
      "file": "동기/과음.png"
    },
    {
      "name": "시기",
      "file": "동기/시기.png"
    },
    {
      "name": "불륜",
      "file": "동기/불륜.png"
    },
    {
      "name": "빚",
      "file": "동기/빚.png"
    },
    {
      "name": "재미",
      "file": "동기/재미.png"
    },
    {
      "name": "청부살인",
      "file": "동기/청부살인.png"
    },
    {
      "name": "배신",
      "file": "동기/배신.png"
    },
    {
      "name": "마약중독",
      "file": "동기/마약중독.png"
    },
    {
      "name": "도박",
      "file": "동기/도박.png"
    },
    {
      "name": "강도",
      "file": "동기/강도.png"
    },
    {
      "name": "욕설",
      "file": "동기/욕설.png"
    },
    {
      "name": "이간질",
      "file": "동기/이간질.png"
    },
    {
      "name": "유산",
      "file": "동기/유산.png"
    },
    {
      "name": "식탐",
      "file": "동기/식탐.png"
    },
    {
      "name": "스토킹",
      "file": "동기/스토킹.png"
    },
    {
      "name": "집착",
      "file": "동기/집착.png"
    },
    {
      "name": "협박",
      "file": "동기/협박.png"
    }
  ],
  "weapons": [
    {
      "name": "수면제",
      "file": "도구/수면제.png"
    },
    {
      "name": "뱀",
      "file": "도구/뱀.png"
    },
    {
      "name": "담배",
      "file": "도구/담배.png"
    },
    {
      "name": "화분",
      "file": "도구/화분.png"
    },
    {
      "name": "곰인형",
      "file": "도구/곰인형.png"
    },
    {
      "name": "햄버거",
      "file": "도구/햄버거.png"
    },
    {
      "name": "립스틱",
      "file": "도구/립스틱.png"
    },
    {
      "name": "드릴",
      "file": "도구/드릴.png"
    },
    {
      "name": "쇼핑백",
      "file": "도구/쇼핑백.png"
    },
    {
      "name": "가방",
      "file": "도구/가방.png"
    },
    {
      "name": "손전등",
      "file": "도구/손전등.png"
    },
    {
      "name": "고춧가루",
      "file": "도구/고춧가루.png"
    },
    {
      "name": "주전자",
      "file": "도구/주전자.png"
    },
    {
      "name": "변기",
      "file": "도구/변기.png"
    },
    {
      "name": "우산",
      "file": "도구/우산.png"
    },
    {
      "name": "코트",
      "file": "도구/코트.png"
    },
    {
      "name": "만년필",
      "file": "도구/만년필.png"
    },
    {
      "name": "시계",
      "file": "도구/시계.png"
    },
    {
      "name": "세탁기",
      "file": "도구/세탁기.png"
    },
    {
      "name": "휘발유",
      "file": "도구/휘발유.png"
    },
    {
      "name": "휴지통",
      "file": "도구/휴지통.png"
    },
    {
      "name": "냉장고",
      "file": "도구/냉장고.png"
    }
  ],
  "adjectives": [
    "얇은",
    "두꺼운",
    "징그러운",
    "수줍은",
    "세심한",
    "치사한",
    "거친",
    "소심한",
    "두려운",
    "붉은",
    "푸른",
    "어두운",
    "밝은",
    "축축한",
    "메마른",
    "뜨거운",
    "차가운",
    "매끄러운",
    "날카로운",
    "부드러운",
    "딱딱한",
    "달콤한",
    "쓰디쓴",
    "아름다운",
    "추악한",
    "시끄러운",
    "조용한",
    "낡은",
    "새로운",
    "무거운",
    "가벼운",
    "뾰족한",
    "둥근",
    "거대한",
    "조그만",
    "은밀한",
    "공공연한",
    "미친",
    "멀쩡한",
    "슬픈",
    "기쁜",
    "잔인한",
    "다정한",
    "더러운",
    "깨끗한",
    "가난한",
    "부유한",
    "어설픈",
    "완벽한",
    "불안한",
    "평온한",
    "기괴한",
    "익숙한",
    "치명적인"
  ],
  "nouns": [
    "감정",
    "진심",
    "말",
    "반복",
    "피로",
    "걱정",
    "하루",
    "습관",
    "얼굴",
    "사랑",
    "증오",
    "돈",
    "빚",
    "피",
    "땀",
    "독",
    "생명",
    "죽음",
    "복수",
    "용서",
    "거짓말",
    "진실",
    "과거",
    "미래",
    "가족",
    "타인",
    "거울",
    "유리",
    "칼",
    "총",
    "밤",
    "낮",
    "음악",
    "소음",
    "약",
    "병",
    "얼굴표정",
    "뒷모습",
    "그림자",
    "빛",
    "벌",
    "보상",
    "선물",
    "저주",
    "인형",
    "사람",
    "시계",
    "시간",
    "반지",
    "족쇄",
    "그림",
    "사진",
    "책",
    "일기"
  ]
};

// Array 셔플 유틸리티 함수
function shuffle(array) {
  let currentIndex = array.length, randomIndex;
  while (currentIndex !== 0) {
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex--;
    [array[currentIndex], array[randomIndex]] = [array[randomIndex], array[currentIndex]];
  }
  return array;
}
